app/controllers/results_controller.rb

  def index
    @match = []
    @student = Student.find(params[:student_id])

    authorize! :read, @student
    @scholarships = Scholarship.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "scholarships".* FROM "scholarships"