app/controllers/scholarships_controller.rb

  def index
    @scholarships = Scholarship.all
    @student = Student.find(params[:student_id])
---
SELECT "scholarships".* FROM "scholarships"
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @scholarship = Scholarship.find(params[:id])
    @student = Student.find(params[:student_id])
---
SELECT  "scholarships".* FROM "scholarships" WHERE "scholarships"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]