app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])

    if @student.update_attributes(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = $1, "last_name" = $2, "student_status" = $3, "zip_code" = $4, "gender" = $5, "ethnicity" = $6, "gpa" = $7, "major" = $8, "email" = $9, "updated_at" = $10 WHERE "students"."id" = $11